#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.k8s.aws_iam_role.iam_role_01: Refreshing state... [id=iam-role-01-dev]
module.vpc.aws_vpc.vpc_01: Refreshing state... [id=vpc-0e2cef2097fae75ba]
module.k8s.aws_iam_role_policy_attachment.role_01_eks_ec2_container_registry_readonly: Refreshing state... [id=iam-role-01-dev-20220205210735361200000004]
module.k8s.aws_iam_role_policy_attachment.role_01_eks_cluster_policy: Refreshing state... [id=iam-role-01-dev-20220205210735358400000001]
module.k8s.aws_iam_role_policy_attachment.role_01_eks_cni_policy: Refreshing state... [id=iam-role-01-dev-20220205210735359200000002]
module.k8s.aws_iam_role_policy_attachment.role_01_eks_pods_resource_controller: Refreshing state... [id=iam-role-01-dev-20220205210735361800000005]
module.k8s.aws_iam_role_policy_attachment.role_01_eks_worker_node_policy: Refreshing state... [id=iam-role-01-dev-20220205210735359900000003]
module.vpc.aws_subnet.subnet_02: Refreshing state... [id=subnet-064bba49d9a31e2b8]
module.vpc.aws_subnet.subnet_01: Refreshing state... [id=subnet-047e1232b936e0898]
module.k8s.aws_eks_cluster.eks_01: Refreshing state... [id=eks-01-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.k8s.aws_eks_cluster.eks_01 has changed
  ~ resource "aws_eks_cluster" "eks_01" {
      + enabled_cluster_log_types = []
        id                        = "eks-01-dev"
        name                      = "eks-01-dev"
        tags                      = {
            "Name" = "eks-01-cluster-dev"
        }
        # (10 unchanged attributes hidden)


      ~ vpc_config {
          + security_group_ids        = []
            # (6 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k8s.aws_eks_node_group.eks_01_node_group_01 will be created
  + resource "aws_eks_node_group" "eks_01_node_group_01" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-01-dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.micro",
          + "t3.micro",
          + "t3a.micro",
        ]
      + node_group_name        = "eks_01_node_group_dev"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::996572201627:role/iam-role-01-dev"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-047e1232b936e0898",
          + "subnet-064bba49d9a31e2b8",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @tairov, Action: `pull_request`*